
const DEPER = [
    {
      "id": "30001",
      "name": "法律系"
    },
    {
      "id": "30002",
      "name": "艺术系"
    },
    {
      "id": "30003",
      "name": "商学院"
    },
    {
      "id": "30004",
      "name": "信息工程学院"
    },
    {
      "id": "30005",
      "name": "土木工程学院"
    },
    {
      "id": "30006",
      "name": "外国语与海外教育学院"
    },
    {
      "id": "30007",
      "name": "马克思主义学院"
    },
    {
      "id": "30008",
      "name": "基础教研部"
    },
    {
      "id": "30009",
      "name": "创新创业教育学院"
    },
    {
      "id": "30010",
      "name": "经济管理综合实验教学中心"
    },
    {
      "id": "30011",
      "name": "继续教育学院"
    },
    {
      "id": "30012",
      "name": "学前教育学院"
    }
  ]
  const MAJOR =  {
    "id":"30004",
    "name":"信息工程学院",
    "major": [
      {
        "id": "300101",
        "name": "电子信息工程",
        "class":[
            {
                "class_id": "30010101",
                "class_name": "2013级电子信息工程1班"
            },
            {
                "class_id": "30010102",
                "class_name": "2014级电子信息工程1班"
            },
            {
                "class_id": "30010103",
                "class_name": "2015级电子信息工程1班"
            },
            {
                "class_id": "30010104",
                "class_name": "2016级电子信息工程1班"
            },
            {
                "class_id": "30010105",
                "class_name": "2017级电子信息工程1班"
            }
        ]
      },
      {
        "id": "300102",
        "name": "通信工程",
        "class":[
          {
              "class_id": "30010201",
              "class_name": "2013级通信工程1班"
          },
          {
              "class_id": "30010202",
              "class_name": "2014级通信工程1班"
          },
          {
              "class_id": "30010203",
              "class_name": "2015级通信工程1班"
          },
          {
              "class_id": "30010204",
              "class_name": "2016级通信工程1班"
          },
          {
              "class_id": "30010205",
              "class_name": "2017级通信工程1班"
          }
      ]
      },
      {
        "id": "300103",
        "name": "物联网工程",
        "class":[
          {
              "class_id": "30010302",
              "class_name": "2014级物联网工程1班"
          },
          {
              "class_id": "30010303",
              "class_name": "2015级物联网工程1班"
          },
          {
              "class_id": "30010304",
              "class_name": "2016级物联网工程1班"
          },
          {
              "class_id": "30010305",
              "class_name": "2017级物联网工程1班"
          }
      ]
      },
      {
        "id": "300104",
        "name": "数字媒体技术",
        "class":[
          {
              "class_id": "30010401",
              "class_name": "2014级数字媒体技术1班"
          },
          {
            "class_id": "30010402",
            "class_name": "2015级数字媒体技术1班"
        },
        {
          "class_id": "30010403",
          "class_name": "2016级数字媒体技术1班"
      },
      {
        "class_id": "30010404",
        "class_name": "2017级数字媒体技术1班"
    }]
      },
      {
        "id": "300105",
        "name": "计算机科学与技术",
        "class":[
          {
            "class_id": "30010501",
            "class_name": "2013级计算机科学与技术1班"
        },
          {
              "class_id": "30010502",
              "class_name": "2014级计算机科学与技术1班"
          },
          {
              "class_id": "30010503",
              "class_name": "2015级计算机科学与技术1班"
          },
          {
              "class_id": "30010504",
              "class_name": "2016级计算机科学与技术1班"
          },
          {
              "class_id": "30010505",
              "class_name": "2017级计算机科学与技术1班"
          }
      ]
      },
      {
        "id": "300106",
        "name": "软件工程",
        "class":[
          {
            "class_id": "30010601",
            "class_name": "2013级软件工程1班"
          },
          {
              "class_id": "30010602",
              "class_name": "2014级软件工程1班"
          },
          {
              "class_id": "30010603",
              "class_name": "2015级软件工程1班"
          },
          {
              "class_id": "30010604",
              "class_name": "2016级软件工程1班"
          },
          {
              "class_id": "30010605",
              "class_name": "2017级软件工程1班"
          }
      ]
      },
      {
        "id": "300107",
        "name": "网络工程",
        "class":[
          {
            "class_id": "30010701",
            "class_name": "2013级网络工程1班"
        },
          {
              "class_id": "30010702",
              "class_name": "2014级网络工程1班"
          },
          {
              "class_id": "30010703",
              "class_name": "2015级网络工程1班"
          },
          {
              "class_id": "30010704",
              "class_name": "2016级网络工程1班"
          },
          {
              "class_id": "30010705",
              "class_name": "2017级网络工程1班"
          }
      ]
      },
      {
        "id": "300108",
        "name": "数据科学与大数据技术",
        "class":[
          {
            "class_id": "30010801",
            "class_name": "2013级数据科学与大数据技术1班"
        },
          {
              "class_id": "30010802",
              "class_name": "2014级数据科学与大数据技术1班"
          },
          {
              "class_id": "30010803",
              "class_name": "2015级数据科学与大数据技术1班"
          },
          {
              "class_id": "30010804",
              "class_name": "2016级数据科学与大数据技术1班"
          },
          {
              "class_id": "30010805",
              "class_name": "2017级数据科学与大数据技术1班"
          }
      ]
      }
    ]
     
  }
  export {DEPER,MAJOR}